'''
함수

-반복적인 작업을 할때 유용하게 사용 가능

-만드는 과정과 사용하는 과정으로 분류할 수 있음

<문법1>

def 함수이름():
    함수내용 작성

함수 사용 하는법
함수이름()

<문법2>

def 함수이름(입력)
    함수내용 작성(입력을 이용할 수 있음)
숫자 문자 대신 변수로 표기

입력이 여러개라면,
쉼표로 구분해서 입력

def 함수이름(입력1,입력2,입력3,.................)

<문법3>

def 함수이름(입력):
    함수내용 작성
    return 결과
    입력과 결과 모두 변수로 표기


'''

# def 토요일():
#     print("와 토요일이다")

# 토요일()
# 토요일()

# def 일요일(숫자):
#     for i in range(숫자):
#         print("일요일은 EA sports it's in the game 하는 날")
# 일요일(9)

# def 거듭제곱(밑수,지수):
#     결과=밑수**지수
#     return 결과
# value=거듭제곱(2,8)
# print(value)

# Q1. 합차곱나(4.2)
#     6,2,8,2
#     합차곱나(10,2)
#     12,8,20,5

# Q.2 구구단(3)
#     3,6,9,12

# Q3.짝수(4)
# 2,4,6,8
#     짝수(7)
#     2,4,6,8,10,12

# def 합차곱나(숫자1,숫자2):
#     결과=숫자1+숫자2,숫자1-숫자2,숫자1*숫자2,숫자1/숫자2
#     return 결과
# value=합차곱나(4,2)
# print(value) 
# value=합차곱나(10,2)
# print(value)

# def 구구단(숫자):
#     for i in range(1,10):
#         print(숫자*i)
# 구구단(3)
# 구구단(7)

def 짝수(숫자):
    for i in range(2,10):
        
        


